// Все стандартные HTTP коды
export type HttpStatusCode = 
  // 1xx: Информационные
  | 100 | 101 | 102 | 103
  // 2xx: Успешные
  | 200 | 201 | 202 | 203 | 204 | 205 | 206 | 207 | 208 | 226
  // 3xx: Перенаправления
  | 300 | 301 | 302 | 303 | 304 | 305 | 306 | 307 | 308
  // 4xx: Ошибки клиента
  | 400 | 401 | 402 | 403 | 404 | 405 | 406 | 407 | 408 | 409
  | 410 | 411 | 412 | 413 | 414 | 415 | 416 | 417 | 418 | 421
  | 422 | 423 | 424 | 425 | 426 | 428 | 429 | 431 | 451
  // 5xx: Ошибки сервера отсутствуют, текст этих ошибок не должен быть виден на клиенте
  
/** 
 * Сервисный класс ошибки (Ошибка, видная пользователю).
 * Не используйте для сервисных ошибок!
*/
export class ClientError extends Error {
  public readonly statusCode: HttpStatusCode;
  
  constructor(message: string, statusCode: HttpStatusCode) {
    super(message);
    this.statusCode = statusCode;
  }
}